app/controllers/sessions_controller.rb

  def create
    user = User.find_by_account(params[:account]) rescue nil
---
SELECT `users`.* FROM `users` WHERE `users`.`account` = '' LIMIT 1