app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
SELECT `roles`.* FROM `roles`
SELECT `users`.* FROM `users` WHERE `users`.`acception` = 'f' AND `users`.`owner` = 'radiusadmin'
---
  def index
    @users = User.all
    @roles = Role.all
    @role = Hash::new
    @roles.each do |role|
      @role["#{role.id}"] = role.position
    end
    @user_waiting = User.find(:all, :conditions => {:acception => 'f', :owner => current_user.account.to_s} )

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 4 LIMIT 1
---
  def show
    @user = User.find(params[:id])
    @role = Role.find(@user.role_id)

SELECT `roles`.* FROM `roles`
---
  def new
    @user = User.new
    @role = Role.all

SELECT `roles`.* FROM `roles`
---
  def newext
    @user = User.new
    @role = Role.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `roles`.* FROM `roles`
---
  def edit
    @user = User.find(params[:id])
#    @role = Role.find(@user.role_id)
    @role = Role.all

INSERT INTO `users` (`account`, `created_at`, `email`, `grade`, `password_digest`, `role_id`, `updated_at`, `username`) VALUES (NULL, '2014-04-02 05:50:12', NULL, NULL, '$2a$10$D6s7eduNHPy7C1gsdAMfg.3E0pzOBEOzidyNBjZHcqb2uVlZzAMju', NULL, '2014-04-02 05:50:12', 'hero')
---
  def create
    @user = User.new(params[:user])
    @role = Role.all
    @user.acception = 't'
#    respond_to do |format|
      if @user.save

SELECT `roles`.* FROM `roles`
SELECT `users`.* FROM `users` WHERE `users`.`account` = 'root' LIMIT 1
INSERT INTO `users` (`acception`, `account`, `created_at`, `email`, `grade`, `owner`, `password_digest`, `role_id`, `updated_at`, `username`) VALUES (0, 'test', '2014-04-03 11:23:40', 'wataken@ep.sci.hokudai.ac.jp', 'M2', 'root', '$2a$10$rZZZc0gSRSIvG73m0KBAMu4w87BrNREVY30N5eKicVKDy3YKrYqAu', 4, '2014-04-03 11:23:40', 'test')
---
  def createext
    @user = User.new(params[:user])
    @role = Role.all
    @owner = User.find_by_account(@user.owner)
    @user.acception = 'f'
    @user.role_id = 4
#    @user.role_id = 925085493

#    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$dhgcKWf/nFxSGv3mC2IAv.CjmDHz8tOalhFJtr3tNilBMkswqSvwW', `updated_at` = '2014-04-02 07:55:41' WHERE `users`.`id` = 3
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `roles`.* FROM `roles`
---
  def mypage
    @user = User.find(params[:id])
    @roles = Role.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
SELECT `roles`.* FROM `roles`
---
  def chpass
    @user = User.find(params[:id])
#    @role = Role.find(@user.role_id)
    @role = Role.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`account` = 'radiusadmin' LIMIT 1
UPDATE `users` SET `acception` = 1, `updated_at` = '2014-04-04 09:35:50' WHERE `users`.`id` = 13
---
  def acception
    @user = User.find(params[:id])
    @user.acception = 't'
    @owner = User.find_by_account(@user.owner)
    respond_to do |format|
      if @user.save